## production: ecs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 15 to add, 9 to change, 12 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.etl_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "etl_policies"  {
      ~ id      = "1554812697" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForlayer",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ecr:ca-central-1:820252213580:repository/covid-server/server-metrics-etl",
                          - "arn:aws:ecr:ca-central-1:820252213580:repository/covid-server/metrics-server",
                          - "arn:aws:ecr:ca-central-1:820252213580:repository/covid-server/appstore-metrics-etl",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/unmasked_server_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/unmasked_server_metrics_ecs",
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/unmasked_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/unmasked_metrics_ecs",
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/unmasked_appstore_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/unmasked_appstore_metrics_ecs",
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/masked_server_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/masked_server_metrics_ecs",
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/masked_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/masked_metrics_ecs",
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/masked_appstore_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/masked_appstore_metrics_ecs",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ec2:DeleteNetworkInterface",
                          - "ec2:CreateNetworkInterface",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ec2:ca-central-1:820252213580:network-interface/*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ec2:DescribeNetworkInterfaces"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:PutObjectAcl",
                          - "s3:PutObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::unmasked-metrics-tdvfd-production/*",
                          - "arn:aws:s3:::unmasked-metrics-tdvfd-production",
                          - "arn:aws:s3:::masked-metrics-tdvfd-production/*",
                          - "arn:aws:s3:::masked-metrics-tdvfd-production",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/masked_metrics_ecs",
              - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/masked_metrics_ecs:log-stream:*",
              - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/unmasked_metrics_ecs",
              - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/unmasked_metrics_ecs:log-stream:*",
              ~ (known after apply),
              ~ (known after apply),
              ~ (known after apply),
              ~ (known after apply),
                # (8 unchanged elements hidden)
            ]
            # (2 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # aws_iam_policy.etl_policies will be updated in-place
  ~ resource "aws_iam_policy" "etl_policies" {
        id        = "arn:aws:iam::820252213580:policy/ETLTaskExecutionPolicies"
        name      = "ETLTaskExecutionPolicies"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForlayer",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ecr:ca-central-1:820252213580:repository/covid-server/server-metrics-etl",
                          - "arn:aws:ecr:ca-central-1:820252213580:repository/covid-server/metrics-server",
                          - "arn:aws:ecr:ca-central-1:820252213580:repository/covid-server/appstore-metrics-etl",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/unmasked_server_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/unmasked_server_metrics_ecs",
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/unmasked_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/unmasked_metrics_ecs",
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/unmasked_appstore_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/unmasked_appstore_metrics_ecs",
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/masked_server_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/masked_server_metrics_ecs",
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/masked_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/masked_metrics_ecs",
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/masked_appstore_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/masked_appstore_metrics_ecs",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ec2:DeleteNetworkInterface",
                          - "ec2:CreateNetworkInterface",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ec2:ca-central-1:820252213580:network-interface/*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ec2:DescribeNetworkInterfaces"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:PutObjectAcl",
                          - "s3:PutObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::unmasked-metrics-tdvfd-production/*",
                          - "arn:aws:s3:::unmasked-metrics-tdvfd-production",
                          - "arn:aws:s3:::masked-metrics-tdvfd-production/*",
                          - "arn:aws:s3:::masked-metrics-tdvfd-production",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.send_falco_alerts_to_CloudWatch_ecs_task will be created
  + resource "aws_iam_policy" "send_falco_alerts_to_CloudWatch_ecs_task" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "SendAlertToCloudWatchPolicies"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:ca-central-1:820252213580:log-group:falco*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role_policy_attachment.falco_te_etl_policies will be created
  + resource "aws_iam_role_policy_attachment" "falco_te_etl_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "metrics_task_execution_role"
    }

  # aws_iam_role_policy_attachment.server_appstore_falco_policies will be created
  + resource "aws_iam_role_policy_attachment" "server_appstore_falco_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "server_appstore_metrics_task_execution_role"
    }

  # module.masked_appstore_metrics_etl.aws_cloudwatch_event_rule.event_rule will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "event_rule" {
        id                  = "masked_appstore_metrics_event_rule"
        name                = "masked_appstore_metrics_event_rule"
      ~ schedule_expression = "rate(24 hours)" -> "cron(0 5 * * ? *)"
        tags                = {
            "Name" = "masked_appstore_metrics-cw-event-rule"
        }
        # (4 unchanged attributes hidden)
    }

  # module.masked_appstore_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "masked_appstore_metrics_event_rule-terraform-20210706203355351400000003"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:820252213580:task-definition/masked_appstore_metrics:5" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.masked_appstore_metrics_etl.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:820252213580:task-definition/masked_appstore_metrics:5" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu              = 0 -> null
                  - essential        = true -> null
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          - hostPort      = 8001 -> null
                          - protocol      = "tcp" -> null
                            # (1 unchanged element hidden)
                        },
                    ]
                  - volumesFrom      = [] -> null
                    # (6 unchanged elements hidden)
                },
            ]
        )
      ~ id                       = "masked_appstore_metrics" -> (known after apply)
      ~ revision                 = 5 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)

      + volume { # forces replacement
          + name = "boot-fs"
        }
      + volume { # forces replacement
          + name = "dev-fs"
        }
      + volume { # forces replacement
          + name = "docker-socket"
        }
      + volume { # forces replacement
          + name = "lib-modules"
        }
      + volume { # forces replacement
          + name = "proc-fs"
        }
      + volume { # forces replacement
          + name = "usr-fs"
        }
    }

  # module.masked_inapp_metrics.data.template_file.masked_metrics will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "masked_metrics"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "MASK_DATA"
                          + value = "${mask_data}"
                        },
                      + {
                          + name  = "ENVIRONMENT"
                          + value = "${environment}"
                        },
                      + {
                          + name  = "BUCKET_NAME"
                          + value = "${bucket_name}"
                        },
                    ]
                  + image            = "${image}"
                  + linuxParameters  = {
                      + capabilities = {
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${awslogs-group}"
                          + awslogs-region        = "${awslogs-region}"
                          + awslogs-stream-prefix = "${awslogs-stream-prefix}"
                        }
                    }
                  + name             = "${name}"
                  + portMappings     = [
                      + {
                          + containerPort = 8001
                        },
                    ]
                  + secrets          = []
                },
            ]
        )
      + vars     = {
          + "awslogs-group"         = "/aws/ecs/masked_inapp_metrics_ecs"
          + "awslogs-region"        = "ca-central-1"
          + "awslogs-stream-prefix" = "ecs-masked-metrics"
          + "bucket_name"           = "masked-metrics-tdvfd-production"
          + "environment"           = "production"
          + "image"                 = "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:23d26c3080824c108aee1e83701fc2fc4796cb5e"
          + "mask_data"             = "True"
          + "name"                  = "masked_inapp_metrics"
        }
    }

  # module.masked_inapp_metrics.aws_cloudwatch_event_rule.event_rule will be created
  + resource "aws_cloudwatch_event_rule" "event_rule" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "masked_inapp_metrics_event_rule"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 3 * * ? *)"
      + tags                = {
          + "Name" = "masked_inapp_metrics-cw-event-rule"
        }
      + tags_all            = {
          + "Name" = "masked_inapp_metrics-cw-event-rule"
        }
    }

  # module.masked_inapp_metrics.aws_cloudwatch_event_target.ecs_scheduled_task will be created
  + resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
      + arn            = "arn:aws:ecs:ca-central-1:820252213580:cluster/in-app-metrics"
      + event_bus_name = "default"
      + id             = (known after apply)
      + role_arn       = "arn:aws:iam::820252213580:role/etl-st-cw-role"
      + rule           = "masked_inapp_metrics_event_rule"
      + target_id      = (known after apply)

      + ecs_target {
          + launch_type         = "FARGATE"
          + platform_version    = "1.4.0"
          + task_count          = 1
          + task_definition_arn = (known after apply)

          + network_configuration {
              + assign_public_ip = false
              + security_groups  = [
                  + "sg-0b77afa7e1b78c3c2",
                ]
              + subnets          = [
                  + "subnet-0279dfba069f58e92",
                ]
            }
        }
    }

  # module.masked_inapp_metrics.aws_cloudwatch_log_group.log will be created
  + resource "aws_cloudwatch_log_group" "log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/masked_inapp_metrics_ecs"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.masked_inapp_metrics.aws_ecs_task_definition.task_def will be created
  + resource "aws_ecs_task_definition" "task_def" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "2048"
      + execution_role_arn       = "arn:aws:iam::820252213580:role/container_execution_role"
      + family                   = "masked_inapp_metrics"
      + id                       = (known after apply)
      + memory                   = "16384"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "CostCentre" = "CovidShield"
        }
      + tags_all                 = {
          + "CostCentre" = "CovidShield"
        }
      + task_role_arn            = "arn:aws:iam::820252213580:role/metrics_task_execution_role"

      + volume {
          + name = "boot-fs"
        }
      + volume {
          + name = "dev-fs"
        }
      + volume {
          + name = "docker-socket"
        }
      + volume {
          + name = "lib-modules"
        }
      + volume {
          + name = "proc-fs"
        }
      + volume {
          + name = "usr-fs"
        }
    }

  # module.masked_metrics.aws_cloudwatch_event_rule.event_rule will be destroyed
  - resource "aws_cloudwatch_event_rule" "event_rule" {
      - arn                 = "arn:aws:events:ca-central-1:820252213580:rule/masked_metrics_event_rule" -> null
      - event_bus_name      = "default" -> null
      - id                  = "masked_metrics_event_rule" -> null
      - is_enabled          = true -> null
      - name                = "masked_metrics_event_rule" -> null
      - schedule_expression = "rate(24 hours)" -> null
      - tags                = {
          - "Name" = "masked_metrics-cw-event-rule"
        } -> null
      - tags_all            = {
          - "Name" = "masked_metrics-cw-event-rule"
        } -> null
    }

  # module.masked_metrics.aws_cloudwatch_event_target.ecs_scheduled_task will be destroyed
  - resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
      - arn            = "arn:aws:ecs:ca-central-1:820252213580:cluster/in-app-metrics" -> null
      - event_bus_name = "default" -> null
      - id             = "masked_metrics_event_rule-terraform-20210623205803383100000003" -> null
      - role_arn       = "arn:aws:iam::820252213580:role/etl-st-cw-role" -> null
      - rule           = "masked_metrics_event_rule" -> null
      - target_id      = "terraform-20210623205803383100000003" -> null

      - ecs_target {
          - launch_type         = "FARGATE" -> null
          - platform_version    = "1.4.0" -> null
          - task_count          = 1 -> null
          - task_definition_arn = "arn:aws:ecs:ca-central-1:820252213580:task-definition/masked_metrics:24" -> null

          - network_configuration {
              - assign_public_ip = false -> null
              - security_groups  = [
                  - "sg-0b77afa7e1b78c3c2",
                ] -> null
              - subnets          = [
                  - "subnet-0279dfba069f58e92",
                ] -> null
            }
        }
    }

  # module.masked_metrics.aws_cloudwatch_log_group.log will be destroyed
  - resource "aws_cloudwatch_log_group" "log" {
      - arn               = "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/masked_metrics_ecs" -> null
      - id                = "/aws/ecs/masked_metrics_ecs" -> null
      - name              = "/aws/ecs/masked_metrics_ecs" -> null
      - retention_in_days = 14 -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # module.masked_metrics.aws_ecs_task_definition.task_def will be destroyed
  - resource "aws_ecs_task_definition" "task_def" {
      - arn                      = "arn:aws:ecs:ca-central-1:820252213580:task-definition/masked_metrics:24" -> null
      - container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "BUCKET_NAME"
                          - value = "masked-metrics-tdvfd-production"
                        },
                      - {
                          - name  = "ENVIRONMENT"
                          - value = "production"
                        },
                      - {
                          - name  = "MASK_DATA"
                          - value = "True"
                        },
                    ]
                  - essential        = true
                  - image            = "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:23d26c3080824c108aee1e83701fc2fc4796cb5e"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/masked_metrics_ecs"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-masked-metrics"
                        }
                    }
                  - mountPoints      = []
                  - name             = "masked_metrics"
                  - portMappings     = [
                      - {
                          - containerPort = 8001
                          - hostPort      = 8001
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = []
                  - volumesFrom      = []
                },
            ]
        ) -> null
      - cpu                      = "2048" -> null
      - execution_role_arn       = "arn:aws:iam::820252213580:role/container_execution_role" -> null
      - family                   = "masked_metrics" -> null
      - id                       = "masked_metrics" -> null
      - memory                   = "16384" -> null
      - network_mode             = "awsvpc" -> null
      - requires_compatibilities = [
          - "FARGATE",
        ] -> null
      - revision                 = 24 -> null
      - tags                     = {
          - "CostCentre" = "CovidShield"
        } -> null
      - tags_all                 = {
          - "CostCentre" = "CovidShield"
        } -> null
      - task_role_arn            = "arn:aws:iam::820252213580:role/metrics_task_execution_role" -> null
    }

  # module.masked_server_metrics_etl.aws_cloudwatch_event_rule.event_rule will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "event_rule" {
        id                  = "masked_server_metrics_event_rule"
        name                = "masked_server_metrics_event_rule"
      ~ schedule_expression = "rate(24 hours)" -> "cron(0 5 * * ? *)"
        tags                = {
            "Name" = "masked_server_metrics-cw-event-rule"
        }
        # (4 unchanged attributes hidden)
    }

  # module.masked_server_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "masked_server_metrics_event_rule-terraform-20210706203355353300000004"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:820252213580:task-definition/masked_server_metrics:7" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.masked_server_metrics_etl.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:820252213580:task-definition/masked_server_metrics:7" -> (known after apply)
      ~ id                       = "masked_server_metrics" -> (known after apply)
      ~ revision                 = 7 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (9 unchanged attributes hidden)

      + volume { # forces replacement
          + name = "boot-fs"
        }
      + volume { # forces replacement
          + name = "dev-fs"
        }
      + volume { # forces replacement
          + name = "docker-socket"
        }
      + volume { # forces replacement
          + name = "lib-modules"
        }
      + volume { # forces replacement
          + name = "proc-fs"
        }
      + volume { # forces replacement
          + name = "usr-fs"
        }
    }

  # module.unmasked_appstore_metrics_etl.aws_cloudwatch_event_rule.event_rule will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "event_rule" {
        id                  = "unmasked_appstore_metrics_event_rule"
        name                = "unmasked_appstore_metrics_event_rule"
      ~ schedule_expression = "rate(24 hours)" -> "cron(0 5 * * ? *)"
        tags                = {
            "Name" = "unmasked_appstore_metrics-cw-event-rule"
        }
        # (4 unchanged attributes hidden)
    }

  # module.unmasked_appstore_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "unmasked_appstore_metrics_event_rule-terraform-20210706203355530800000005"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:820252213580:task-definition/unmasked_appstore_metrics:5" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.unmasked_appstore_metrics_etl.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:820252213580:task-definition/unmasked_appstore_metrics:5" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu              = 0 -> null
                  - essential        = true -> null
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          - hostPort      = 8001 -> null
                          - protocol      = "tcp" -> null
                            # (1 unchanged element hidden)
                        },
                    ]
                  - volumesFrom      = [] -> null
                    # (6 unchanged elements hidden)
                },
            ]
        )
      ~ id                       = "unmasked_appstore_metrics" -> (known after apply)
      ~ revision                 = 5 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)

      + volume { # forces replacement
          + name = "boot-fs"
        }
      + volume { # forces replacement
          + name = "dev-fs"
        }
      + volume { # forces replacement
          + name = "docker-socket"
        }
      + volume { # forces replacement
          + name = "lib-modules"
        }
      + volume { # forces replacement
          + name = "proc-fs"
        }
      + volume { # forces replacement
          + name = "usr-fs"
        }
    }

  # module.unmasked_inapp_metrics.data.template_file.masked_metrics will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "masked_metrics"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "MASK_DATA"
                          + value = "${mask_data}"
                        },
                      + {
                          + name  = "ENVIRONMENT"
                          + value = "${environment}"
                        },
                      + {
                          + name  = "BUCKET_NAME"
                          + value = "${bucket_name}"
                        },
                    ]
                  + image            = "${image}"
                  + linuxParameters  = {
                      + capabilities = {
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${awslogs-group}"
                          + awslogs-region        = "${awslogs-region}"
                          + awslogs-stream-prefix = "${awslogs-stream-prefix}"
                        }
                    }
                  + name             = "${name}"
                  + portMappings     = [
                      + {
                          + containerPort = 8001
                        },
                    ]
                  + secrets          = []
                },
            ]
        )
      + vars     = {
          + "awslogs-group"         = "/aws/ecs/unmasked_inapp_metrics_ecs"
          + "awslogs-region"        = "ca-central-1"
          + "awslogs-stream-prefix" = "ecs-unmasked-metrics"
          + "bucket_name"           = "unmasked-metrics-tdvfd-production"
          + "environment"           = "production"
          + "image"                 = "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:23d26c3080824c108aee1e83701fc2fc4796cb5e"
          + "mask_data"             = "False"
          + "name"                  = "unmasked_inapp_metrics"
        }
    }

  # module.unmasked_inapp_metrics.aws_cloudwatch_event_rule.event_rule will be created
  + resource "aws_cloudwatch_event_rule" "event_rule" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "unmasked_inapp_metrics_event_rule"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 4 * * ? *)"
      + tags                = {
          + "Name" = "unmasked_inapp_metrics-cw-event-rule"
        }
      + tags_all            = {
          + "Name" = "unmasked_inapp_metrics-cw-event-rule"
        }
    }

  # module.unmasked_inapp_metrics.aws_cloudwatch_event_target.ecs_scheduled_task will be created
  + resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
      + arn            = "arn:aws:ecs:ca-central-1:820252213580:cluster/in-app-metrics"
      + event_bus_name = "default"
      + id             = (known after apply)
      + role_arn       = "arn:aws:iam::820252213580:role/etl-st-cw-role"
      + rule           = "unmasked_inapp_metrics_event_rule"
      + target_id      = (known after apply)

      + ecs_target {
          + launch_type         = "FARGATE"
          + platform_version    = "1.4.0"
          + task_count          = 1
          + task_definition_arn = (known after apply)

          + network_configuration {
              + assign_public_ip = false
              + security_groups  = [
                  + "sg-0b77afa7e1b78c3c2",
                ]
              + subnets          = [
                  + "subnet-0279dfba069f58e92",
                ]
            }
        }
    }

  # module.unmasked_inapp_metrics.aws_cloudwatch_log_group.log will be created
  + resource "aws_cloudwatch_log_group" "log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/unmasked_inapp_metrics_ecs"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.unmasked_inapp_metrics.aws_ecs_task_definition.task_def will be created
  + resource "aws_ecs_task_definition" "task_def" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "2048"
      + execution_role_arn       = "arn:aws:iam::820252213580:role/container_execution_role"
      + family                   = "unmasked_inapp_metrics"
      + id                       = (known after apply)
      + memory                   = "16384"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "CostCentre" = "CovidShield"
        }
      + tags_all                 = {
          + "CostCentre" = "CovidShield"
        }
      + task_role_arn            = "arn:aws:iam::820252213580:role/metrics_task_execution_role"

      + volume {
          + name = "boot-fs"
        }
      + volume {
          + name = "dev-fs"
        }
      + volume {
          + name = "docker-socket"
        }
      + volume {
          + name = "lib-modules"
        }
      + volume {
          + name = "proc-fs"
        }
      + volume {
          + name = "usr-fs"
        }
    }

  # module.unmasked_metrics.aws_cloudwatch_event_rule.event_rule will be destroyed
  - resource "aws_cloudwatch_event_rule" "event_rule" {
      - arn                 = "arn:aws:events:ca-central-1:820252213580:rule/unmasked_metrics_event_rule" -> null
      - event_bus_name      = "default" -> null
      - id                  = "unmasked_metrics_event_rule" -> null
      - is_enabled          = true -> null
      - name                = "unmasked_metrics_event_rule" -> null
      - schedule_expression = "rate(24 hours)" -> null
      - tags                = {
          - "Name" = "unmasked_metrics-cw-event-rule"
        } -> null
      - tags_all            = {
          - "Name" = "unmasked_metrics-cw-event-rule"
        } -> null
    }

  # module.unmasked_metrics.aws_cloudwatch_event_target.ecs_scheduled_task will be destroyed
  - resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
      - arn            = "arn:aws:ecs:ca-central-1:820252213580:cluster/in-app-metrics" -> null
      - event_bus_name = "default" -> null
      - id             = "unmasked_metrics_event_rule-terraform-20210623205803384500000004" -> null
      - role_arn       = "arn:aws:iam::820252213580:role/etl-st-cw-role" -> null
      - rule           = "unmasked_metrics_event_rule" -> null
      - target_id      = "terraform-20210623205803384500000004" -> null

      - ecs_target {
          - launch_type         = "FARGATE" -> null
          - platform_version    = "1.4.0" -> null
          - task_count          = 1 -> null
          - task_definition_arn = "arn:aws:ecs:ca-central-1:820252213580:task-definition/unmasked_metrics:23" -> null

          - network_configuration {
              - assign_public_ip = false -> null
              - security_groups  = [
                  - "sg-0b77afa7e1b78c3c2",
                ] -> null
              - subnets          = [
                  - "subnet-0279dfba069f58e92",
                ] -> null
            }
        }
    }

  # module.unmasked_metrics.aws_cloudwatch_log_group.log will be destroyed
  - resource "aws_cloudwatch_log_group" "log" {
      - arn               = "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/unmasked_metrics_ecs" -> null
      - id                = "/aws/ecs/unmasked_metrics_ecs" -> null
      - name              = "/aws/ecs/unmasked_metrics_ecs" -> null
      - retention_in_days = 14 -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # module.unmasked_metrics.aws_ecs_task_definition.task_def will be destroyed
  - resource "aws_ecs_task_definition" "task_def" {
      - arn                      = "arn:aws:ecs:ca-central-1:820252213580:task-definition/unmasked_metrics:23" -> null
      - container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "BUCKET_NAME"
                          - value = "unmasked-metrics-tdvfd-production"
                        },
                      - {
                          - name  = "ENVIRONMENT"
                          - value = "production"
                        },
                      - {
                          - name  = "MASK_DATA"
                          - value = "False"
                        },
                    ]
                  - essential        = true
                  - image            = "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:23d26c3080824c108aee1e83701fc2fc4796cb5e"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/unmasked_metrics_ecs"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-unmasked-metrics"
                        }
                    }
                  - mountPoints      = []
                  - name             = "unmasked_metrics"
                  - portMappings     = [
                      - {
                          - containerPort = 8001
                          - hostPort      = 8001
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = []
                  - volumesFrom      = []
                },
            ]
        ) -> null
      - cpu                      = "2048" -> null
      - execution_role_arn       = "arn:aws:iam::820252213580:role/container_execution_role" -> null
      - family                   = "unmasked_metrics" -> null
      - id                       = "unmasked_metrics" -> null
      - memory                   = "16384" -> null
      - network_mode             = "awsvpc" -> null
      - requires_compatibilities = [
          - "FARGATE",
        ] -> null
      - revision                 = 23 -> null
      - tags                     = {
          - "CostCentre" = "CovidShield"
        } -> null
      - tags_all                 = {
          - "CostCentre" = "CovidShield"
        } -> null
      - task_role_arn            = "arn:aws:iam::820252213580:role/metrics_task_execution_role" -> null
    }

  # module.unmasked_server_metrics_etl.aws_cloudwatch_event_rule.event_rule will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "event_rule" {
        id                  = "unmasked_server_metrics_event_rule"
        name                = "unmasked_server_metrics_event_rule"
      ~ schedule_expression = "rate(24 hours)" -> "cron(0 5 * * ? *)"
        tags                = {
            "Name" = "unmasked_server_metrics-cw-event-rule"
        }
        # (4 unchanged attributes hidden)
    }

  # module.unmasked_server_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "unmasked_server_metrics_event_rule-terraform-20210706203355649900000006"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:820252213580:task-definition/unmasked_server_metrics:7" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.unmasked_server_metrics_etl.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:820252213580:task-definition/unmasked_server_metrics:7" -> (known after apply)
      ~ id                       = "unmasked_server_metrics" -> (known after apply)
      ~ revision                 = 7 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (9 unchanged attributes hidden)

      + volume { # forces replacement
          + name = "boot-fs"
        }
      + volume { # forces replacement
          + name = "dev-fs"
        }
      + volume { # forces replacement
          + name = "docker-socket"
        }
      + volume { # forces replacement
          + name = "lib-modules"
        }
      + volume { # forces replacement
          + name = "proc-fs"
        }
      + volume { # forces replacement
          + name = "usr-fs"
        }
    }

Plan: 15 to add, 9 to change, 12 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>